# RbsElecShortCircuitRating Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecShortCircuitRating Property
ParameterTypeId Class See Also
---
"Short Circuit Rating"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecShortCircuitRating { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecShortCircuitRating As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecShortCircuitRating {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace